# Задание 5.
# Написать функцию которая ходит в api github и возвращает одним списком number из закрытых issues в проекте
# microsoft/dotnet @GitHub

import requests

def get_numbers():
    
    pass

if __name__ == "__main__":
    print(get_numbers())
